iainchesworthlabs/ac3forge/esp-idf/ac3forge/examples/hearth_sink/sdkconfig.defaults
# ESP-IDF configuration for the Hearth sink example.
#
# The same shape as the i2s_player example beside it - see that file for why
# each setting is what it is - plus a custom partition table, which is the one
# thing this example needs and that one does not.

CONFIG_IDF_TARGET="esp32s3"
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
# 8 KB, not the 32 KB i2s_player and the probe give their main task: since
# 2026-09-10 the decode runs on the player's own task (ac3forge::Player, whose
# PlayerConfig::decode_stack_bytes is the 32 KB the probe measured a decode
# needing 21 KB of), and app_main only wires the seams and prints. The 24 KB
# this gives back is heap the E-AC-3 decoder needs when WiFi is up: the first
# two-task build aborted on an allocation in exactly that shape.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# The audio partition lives here. Without this IDF uses its own single-factory
# table, which has nowhere to put a stream.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Two application slots, and a bootloader that goes back to the one that ran
# before (partitions.csv, planning/esp32-ota.md). An image an update writes
# boots on trial, and a reset before that image accepts itself boots the other
# slot instead. An image flashed over USB is never on trial: `idf.py flash`
# writes an empty otadata, and the bootloader boots ota_0 from it as it booted
# the factory slot before. The bootloader itself changes only over USB.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# PSRAM stays off, as everywhere else in this profile: the point is that the
# decode fits in internal SRAM, and the streaming buffers are part of what has
# to fit.

# The console carries Improv Wi-Fi's binary packets as well as the lines this
# example prints (main/provision.cpp), so nothing may rewrite a byte of it.
# ESP-IDF's defaults do: CR from a client arrives as LF, and CR goes out before
# every LF. Either one lands inside a packet - a length byte, a string, a
# checksum - and the packet then fails its checksum at the other end. Measured
# on 2026-09-17 with the defaults: a wifi_settings whose SSID is 13 bytes long
# (its length byte is CR) was answered invalid_packet, so a board could not be
# given a network named, for instance, MyHomeNetwork; and with a 10-character
# name stored, the device_info and device_name answers left the board corrupt.
#
# LF both ways instead, which is no conversion at all. It costs the CR at the
# end of each line the application prints; the ROM's own lines and anything
# logged from an interrupt go out through esp_rom_printf, which never saw this
# setting and still ends them CR LF. idf.py monitor and the checks under
# tools/checks read either, and a terminal that needs the CR (PuTTY, picocom)
# has a setting for it. Set here rather than in the code because it
# also covers the secondary console - a board with its console on UART still
# answers Improv over USB - which the per-console calls cannot reach.
CONFIG_LIBC_STDIN_LINE_ENDING_LF=y
CONFIG_LIBC_STDOUT_LINE_ENDING_LF=y

# 240 MHz, asked for rather than inherited. ESP-IDF's default is 160, two
# thirds of what the part does, and a player that has to finish each frame
# inside the 32 ms the DAC takes to play it should name the clock it was
# measured at. apps/baremetal/platform/esp32s3/sdkconfig.defaults has the
# measurement: the decode scales with the clock almost exactly, so this is the
# single largest setting on the part.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
